---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.ThinHostFloor
source: html/8069ecb2-bbb5-cfa8-c44b-9cd173a214c8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.ThinHostFloor Property

Rebar Cover Top and Bottom are too large for host.

## Syntax (C#)
```csharp
public static FailureDefinitionId ThinHostFloor { get; }
```